app/views/posts/show.html.erb

    <%= render 'comments/form', comment: @comment %>
    <% @post.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 2]]