app/controllers/comments_controller.rb

INSERT INTO "comments" ("author", "comment_entry", "created_at", "updated_at", "post_id") VALUES (?, ?, ?, ?, ?)  [["author", "Ryan"], ["comment_entry", "Pffffft...I really like drama!"], ["created_at", "2017-10-19 12:39:15.909354"], ["updated_at", "2017-10-19 12:39:15.909354"], ["post_id", 2]]
---
  def create
    @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save