app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = ? LIMIT ? OFFSET ?  [["user_id", 6], ["LIMIT", 3], ["OFFSET", 0]]
---
  def user_posts
    @user = User.find_by(username: params[:name])
    @posts = @user.posts.page(params[:page])

SELECT  "posts".* FROM "posts" LIMIT ? OFFSET ?  [["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"
---
  def index
    @posts = Post.all.page(params[:page])

INSERT INTO "posts" ("title", "blog_entry", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "An Apple A Day"], ["blog_entry", "Keeps the doctor away!"], ["created_at", "2017-10-19 14:18:27.692322"], ["updated_at", "2017-10-19 14:18:27.692322"], ["user_id", 1]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "title" = ?, "blog_entry" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Test"], ["blog_entry", "I love the beach."], ["updated_at", "2017-10-20 11:06:04.992435"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)